{"item":[{"date":"2017-04-24T09:11:56.000Z","title":"Two important victories in two weeks","link":"https://genevacricketclub.wordpress.com/2017/04/24/two-important-victories-in-two-weeks/","description":"<p>Geneva CC started the season on the right foot by lifting the Geneva T20 Cup. It became very clear too to our players that it was also important to win the first friendly in the 40 overs format.</p>\n<h3>Bout-du-Monde, 16 April 2017, friendly 40-over match vs ZLCC</h3>\n<p><a href=\"https://www.crichq.com/#matches/505042/1st_innings\" target=\"_blank\" rel=\"noopener noreferrer\"><b>Geneva Cricket Club</b>, 207 for 6 in 21 overs (Idrees 44, Viki 34*, Ravi Sankar 2-32), <strong>beat Zürich Lions Cricket Club</strong>, 206 all out in 40 overs (S Naren 71, Afif 4-34), <strong>by 4 wickets</strong></a></p>\n<p>(Click on the results above to see the full digital scorecard!)</p>\n<p>On 16 April, Geneva CC won two friendlies against Zürich Lions CC at the Bout-du-Monde. It seemed that this was the very first match of the Zürich Lions against another Swiss team since the foundation of the club at the beginning of the year.</p>\n<p>Even though too many wickets fell, Geneva CC chased the score with ease and reached the target in only 21 overs. Plenty of time was left therefore captians from both teams decided to play a fun 10-over match too!</p>\n<p>Geneva CC scored 189 for 4 in 10 overs and Zürich Lions made 92 for 6 in 10 overs, beating thus the Lions by 97 runs. Ali Shah made a very special innings with 102 runs in 32 balls, which is quite an astounding feat for just an innings of 60 balls!</p>\n<h3>Bout-du-Monde, 23 April 2017, friendly 40-over match vc GICC</h3>\n<p><a href=\"https://www.crichq.com/#matches/507292/1st_innings\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>Geneva Cricket Club</strong>, 279 all out in 37.2 overs (Massoud 118, Khurram 56, Farooq 4-48, Richard 3-19), <strong>beat Geneva International Cricket Club</strong>, 262 all out in 39.2 overs (Bakir 51, Zahid 3-40), <strong>by 17 runs</strong></a></p>\n<p>(Click on the results above to see the full digital scorecard!)</p>\n<p>GICC hosted a 40-over match on a (again!) beautiful and sunny Sunday which promised to deliver some good stuff for cricketers. Overall, it was a very good match of cricket with plenty of emotions. Geneva CC were straight away constrained by a great opening bowling partnership of Richard and Jibran. Wickets fell way too early with three batsman dismissed in 7.2 overs for just 26 runs. That is when Massoud stepped in and changed the innings. in 20 overs, the score was then at 107 for 4 and continued to rise consistently. The Lion of Panjshir went to score a blasting century in 55 balls thanks to solid contributions from his partners Parit and Dalvinder. He of course reached the benchmark with a blasting six over deep square leg.</p>\n<p>The hosts took the advantage back with Farooq taking a crazy hat-trick in two separate overs. Skipper Khurram put the bowling momentum on hold with the young Zahid and went to add a 50+ partnership to the tally. Aamir and Darius helped Khurram reaching his half-ton before he was finally caught at cover.</p>\n<p>GICC had to chase a defend-able score of 280 to win the match in 240 balls. The start of the game was not as slow as Geneva CC&#8217;s but more wickets were put down thanks to a solid performance by opening bowler Aamir. DC and Zahid contributed too, despite conceding too many extras. This problem actually spreaded amongst nearly all Geneva&#8217;s bowlers&#8230; who gave out a total of 41 wides. Hopefully the last time this season!</p>\n<p>After the drinks break, GICC had 101 runs for 5 wickets in 20 overs. Bakir and Richard put up a strong fight and partnered for nearly 90 runs together. Right after scoring his fifty, Afif caught a superb catch behind off Zahid&#8217;s ball and things started to slowly unravel. With only one wicket in hand, Ajay and Farooq scared Geneva a bit by hitting boundaries to boundaries in the last overs, until Zahid wrapped it up by crashing the stumps with 4 balls remaining. Kudos to captain Khurram for his outstanding catch at long off while unintentionally slipping and for a super difficult direct hit that dismissed Jibran from point.</p>\n<p>Geneva CC is victorious again and hopes to continue winning when they will be in South of France next week!</p><br />  <a rel=\"nofollow\" href=\"http://feeds.wordpress.com/1.0/gocomments/genevacricketclub.wordpress.com/2550/\"><img alt=\"\" border=\"0\" src=\"http://feeds.wordpress.com/1.0/comments/genevacricketclub.wordpress.com/2550/\" /></a> <img alt=\"\" border=\"0\" src=\"https://pixel.wp.com/b.gif?host=genevacricketclub.wordpress.com&#038;blog=108392122&#038;post=2550&#038;subd=genevacricketclub&#038;ref=&#038;feed=1\" width=\"1\" height=\"1\" />"},{"date":"2017-04-10T21:30:35.000Z","title":"We won the Geneva T20 Cup!","link":"https://genevacricketclub.wordpress.com/2017/04/10/we-won-the-geneva-t20-cup/","description":"<h4>Bout-du-Monde, 8-9 April 2017, Geneva T20 Cup</h4>\n<p>Click on the results to see the full scorecard!</p>\n<p><strong>First match</strong></p>\n<p><a href=\"https://www.crichq.com/#matches/502338/match_info\" target=\"_blank\"><b>Geneva Sri Lanka Cricket Club</b>, 182 for 8 in 18.3 overs (Krishanta 53, Idrees 2-15), <strong>beat Geneva Cricket Club</strong>, 180 for 7 in 20 overs (Idrees 71, Khurram 49*, Uddika 3-21), </a><strong><a href=\"https://www.crichq.com/#matches/502338/match_info\" target=\"_blank\">by 2 wickets</a><br />\n</strong></p>\n<p><strong>Second match</strong></p>\n<p><a href=\"https://www.crichq.com/#matches/502695/match_info\" target=\"_blank\"><b>Geneva Cricket Club</b>, 143 for 4 in 15.5 overs (Ali Shah 37, Asghar 2-32), <strong>beat Geneva XI Stars</strong>, 141 for 9 in 20 overs (Lalit 45, Kashif 3-35), <strong>by 6 wickets</strong></a></p>\n<p><strong>Final</strong></p>\n<p><a href=\"https://www.crichq.com/#matches/502748/match_info\" target=\"_blank\"><b>Geneva Cricket Club</b>, 122 for 5 in 12.2 overs (Idrees 35, Hans 2-18), <strong>beat Geneva Sri Lanka Cricket Club</strong>, 120 all out in 16.2 overs (Krishanta 36, Dalvinder 2-19, Zahid 2-19), <strong>by 5 wickets</strong></a></p>\n<p>&nbsp;</p>\n<p>The 2017 season started pretty well for the oldest cricket club in Switzerland. For its third edition, Geneva CC finally won the trophy of the Geneva T20 Cup!</p>\n<p>After a difficult start tainted by a disappointing loss against GESLCC, Geneva CC retook the advantage by defeating XI Stars thanks to a very consistent performance from batsmen and tight bowling. The same approach was adopted in the final, which started very strongly for GESLCC (30 runs in just 2 overs). 26 runs and 22 balls later, three crucial wickets went down, which ultimately paved the way for a proper batting collapse.</p>\n<p>GESLCC were all out with 22 balls remaining to defend a not-so-high score of 120. The target was chased in just 12.2 overs to give a 5-wicket victory to Geneva CC.</p>\n<p>The beautiful thing of this tournament is that everybody contributed to build up the innings and bring the trophy home. Props to our skipper Anser for his awesome captaincy and great decisions on the field with the Vice-Captain Khurram. Kudos to Idrees, Khurram and Ali for their outstanding batting with the best scores of 71, 49 not out and 37 respectively and good contributions from Leo and Kashif.</p>\n<p>Amazing bowling efforts from youngsters Afif and Zahid, as well as from the more experienced Ronak, Leo and Dalvinder. Kashif ended up with a total of 6 wickets in the competition, including 3 killing yorkers against the best batsmen of XI Stars that day.</p>\n<p>The fielding performances were also spotless, with Ashwin as the wicketkeeper, taking 6 catches and smashing wickets twice with direct hits. Khurram took 4 catches in the final, including an amazing one at third man and we also saw some pretty damn good caught-and-bowled from Dalvinder, Leo and Zahid.</p>\n<p>For the statistics of the Geneva T20 Cup, <a href=\"https://www.crichq.com/#competitions/9761/draws/30253/leaderboards/\" target=\"_blank\">click here!</a></p>\n<p>All in all, a deserved victory for a tough competition. We hope that this bodes well for the season 2017!</p>\n<p>&nbsp;</p><br />  <a rel=\"nofollow\" href=\"http://feeds.wordpress.com/1.0/gocomments/genevacricketclub.wordpress.com/2470/\"><img alt=\"\" border=\"0\" src=\"http://feeds.wordpress.com/1.0/comments/genevacricketclub.wordpress.com/2470/\" /></a> <img alt=\"\" border=\"0\" src=\"https://pixel.wp.com/b.gif?host=genevacricketclub.wordpress.com&#038;blog=108392122&#038;post=2470&#038;subd=genevacricketclub&#038;ref=&#038;feed=1\" width=\"1\" height=\"1\" />"},{"date":"2017-03-31T13:48:39.000Z","title":"Start of the season 2017: facing 28 consecutive bouncers? Now possible!","link":"https://genevacricketclub.wordpress.com/2017/03/31/start-of-the-season-2017-facing-28-consecutive-bouncers-now-possible/","description":"<p>April is right around the corner, which means that the cricket season is setting off! Our players are getting super excited and Geneva CC is preparing for a great season ahead.</p>\n<p>Here is our busy programme for April:</p>\n<ul>\n<li><strong>8 and 9 April</strong>: the <strong>Geneva T20 Cricket Tournament</strong>, hosted jointly this year by Geneva CC and Geneva Sri Lanka CC at the Bout-du-Monde. From 12:00 till 18:00 on both days, preceded by a short practice session;</li>\n<li><strong>16 April</strong>: <strong>Friendly 40-over match against Zurich Lions</strong>, 12:00-18:00, Bout-du-Monde;</li>\n<li><strong>22 April</strong>: First official practice session of the year at the Bout-du-Monde;</li>\n<li><strong>29 and 30 April</strong>: <strong>International tour to South of France</strong> in Entrecasteaux to play two <strong>35-over matches against Entrecasteaux CC and Monte-Carlo CC.</strong></li>\n</ul>\n<p>Furthermore, some of you might be aware of it, but the Geneva Cricket Club has decided to renew some of its practice equipment this season. This includes a Bola bowling machine with a 28-ball automatic feeder, a brand new netting installation system, and new professional nets and poles. The bowling machine is already home and the rest should be set up by the end of April.</p>\n<p><strong>Thanks to Geneva Sri Lanka CC</strong> for sharing the financial burden with respect to the netting system, in particular its <strong>President Sunil Perera</strong>. Thanks also to the following people who have given substantial donations to the Club to make this possible:</p>\n<ul>\n<li><strong>Hascal Gollop</strong>, President;</li>\n<li><strong>Nayyar Syed</strong>, Vice-President;</li>\n<li><strong>Faizan Ul-Haq</strong>, Secretary-General;</li>\n<li><strong>Anser Mehmood</strong>, Club Manager, Fixture Secretary and Captain;</li>\n<li><strong>Khurram Alvi</strong>, Vice-Captain;</li>\n<li><strong>Darius Rao</strong>, Secretary-Treasurer;</li>\n<li><strong>Saqib Aurangzeb</strong>, Full Member</li>\n<li><strong>Ronak Kamdar</strong>, Full Member</li>\n</ul>\n<p>Let&#8217;s have a blast this season!</p><br />  <a rel=\"nofollow\" href=\"http://feeds.wordpress.com/1.0/gocomments/genevacricketclub.wordpress.com/2286/\"><img alt=\"\" border=\"0\" src=\"http://feeds.wordpress.com/1.0/comments/genevacricketclub.wordpress.com/2286/\" /></a> <img alt=\"\" border=\"0\" src=\"https://pixel.wp.com/b.gif?host=genevacricketclub.wordpress.com&#038;blog=108392122&#038;post=2286&#038;subd=genevacricketclub&#038;ref=&#038;feed=1\" width=\"1\" height=\"1\" />"}]}