{"item":[{"date":"2017-03-07T11:39:12.000Z","title":"Un sponsor et des récompenses incroyables! Amazing awards and sponsorship!","link":"https://genevacricketclub.wordpress.com/2017/03/07/un-sponsor-et-des-recompenses-incroyables-amazing-awards-and-sponsorphip/","description":"<p><strong>En français</strong></p>\n<p>Le Geneva Cricket Club, fondé en 1872, est fier d&#8217;annoncer que M. Saqib Aurangzeb, propriétaire de <a href=\"https://www.facebook.com/TACOS-Kibs-Restaurant-1053643754675858/?fref=ts\" target=\"_blank\">Kibs Tacos</a> à Genève et de <a href=\"https://www.facebook.com/Kibs-Resturant-226292964443239/?fref=ts\" target=\"_blank\">Kibs Restaurant</a> à Abbottabad (Pakistan), a décidé de sponsoriser le club de cricket le plus prestigieux et ancien de Suisse.</p>\n<p>Une belle enveloppe de 1000 francs a été donné au Club! 500 francs sont donnés à l&#8217;équipe pour la saison 2017; 300 francs sont octroyés à Darius Rao pour la meilleure progression de 2016; et 200 francs sont octroyés à Idrees Haque pour avoir obtenu le meilleur score des matchs officiels de la saison 2016.</p>\n<p>Le Geneva Cricket Club remercie chaleureusement Saqib pour sa générosité et son engagement au sein de l&#8217;équipe. Sa donation est cruciale pour le Club, qui par ailleurs appelle tous ses supporters et autres à se ruer à <a href=\"https://www.facebook.com/TACOS-Kibs-Restaurant-1053643754675858/?fref=ts\" target=\"_blank\">Kibs Tacos</a> pour goûter aux meilleurs tacos de Suisse. Tout simplement!</p>\n<p>Le restaurant <a href=\"https://www.facebook.com/TACOS-Kibs-Restaurant-1053643754675858/?fref=ts\" target=\"_blank\">Kibs Tacos</a> est désormais un repère des fans du cricket et plus encore! Merci encore pour ce soutien inconditionnel!</p>\n<p>&nbsp;</p>\n<p><strong>In English</strong></p>\n<p>The Geneva Cricket Club, founded in 1872, is proud to announce that Mr Saqib Aurangzeb, owner of  <a href=\"https://www.facebook.com/TACOS-Kibs-Restaurant-1053643754675858/?fref=ts\" target=\"_blank\">Kibs Tacos</a> in Geneva (Switzerland) and <a href=\"https://www.facebook.com/Kibs-Resturant-226292964443239/?fref=ts\" target=\"_blank\">Kibs Restaurant</a> in Abbottabad (Pakistan), has decided to sponsor the oldest and most prestigious cricket club in Switzerland.</p>\n<p>A marvelous envelope of 1000 Swiss francs (104&#8217;000 PKR) was given to the Club! 500 francs are given to the team for the 2017 season; 300 francs are granted to Darius Rao for the best progression of 2016; and 200 francs are granted to Idrees Haque for obtaining the best score of the official matches of the season 2016.</p>\n<p>The Geneva Cricket Club warmly thanks Saqib for his generosity and commitment to the team. His donation is crucial for the Club, which also calls all of its supporters and others to rush to <a href=\"https://www.facebook.com/TACOS-Kibs-Restaurant-1053643754675858/?fref=ts\" target=\"_blank\">Kibs Tacos</a> to taste the best tacos of Switzerland. No doubts about it!</p>\n<p>The restaurant <a href=\"https://www.facebook.com/TACOS-Kibs-Restaurant-1053643754675858/?fref=ts\" target=\"_blank\">Kibs Tacos</a> is now a cricket fan base and more! Thanks again for this unconditional support!</p>\n<p>&nbsp;</p><br />  <a rel=\"nofollow\" href=\"http://feeds.wordpress.com/1.0/gocomments/genevacricketclub.wordpress.com/2339/\"><img alt=\"\" border=\"0\" src=\"http://feeds.wordpress.com/1.0/comments/genevacricketclub.wordpress.com/2339/\" /></a> <img alt=\"\" border=\"0\" src=\"https://pixel.wp.com/b.gif?host=genevacricketclub.wordpress.com&#038;blog=108392122&#038;post=2339&#038;subd=genevacricketclub&#038;ref=&#038;feed=1\" width=\"1\" height=\"1\" />"},{"date":"2017-03-05T16:39:49.000Z","title":"Annual General Meeting 2017 Report","link":"https://genevacricketclub.wordpress.com/2017/03/05/annual-general-meeting-2017-report/","description":"<p>On 27 February 2017, the Annual General Meeting of the Geneva Cricket Club took place at the Madison Pub in la Servette.</p>\n<p>Annual reports from Committee members and minutes of the previous AGM were all approved. Various amendments to the Constitution of the Club were adopted with the view of aligning it with the Swiss law and adapting it to the new management system. A Central Committee has been established and the Committee has been transformed into an Executive Committee. Furthermore, Members agreed on creating a new body for more accountability and transparency: a Statutory Auditor. All members of the  Central and the Executive Committee were elected unanimously.</p>\n<p>Anser Mehmood has been voted in as Captain in both format of the game with unanimous support of all team members, which meant he preserved his role in the league games and replaced Saeed Raja in the T20 games. Khurram Alvi also garnered complete support to continue as Vice-Captain in all formats.</p>\n<p>As provided in the amended Constitution of the club, a Statutory Auditor was elected for the very first time. Ahmad Daqiqui was thus elected unanimously to fill in the role.</p>\n<p>Membership fees were maintained at CHF 200 for Full Members (CHF 150 for newcomers, students and unemployed).</p>\n<p>Five new members were officially welcomed: Zahid Abdullrahimzi, Vignesh Sethuraman, Mian Ali Shah, Dalvinder Singh and Ashwin Vinod. New other members are also expected to join the club before the end of March!</p>\n<p>Members were also briefed on the fact that Geneva CC obtained full Associate Status within Cricket Switzerland. Furthermore, the Treasurer of the Club, Darius Rao, talked to the Members about his initiative regarding the foundation of an &#8220;Association genevoise de cricket&#8221;, hoping to establish it by the end of the first semester this year. He mentioned also the two financial support requests made to the Fonds cantonal d&#8217;aide au sport and talked about the project to purchase a bowling machine and to improve the net installation system at the Bout-du-Monde.</p>\n<p>Finally, Club Manager Anser Mehmood mentioned that official Match Managers will be nominated before every match. The meeting was then closed with a great speech from Vice-President Nayyar Syed, who called players to fight ferociously for trophies this year!</p><br />  <a rel=\"nofollow\" href=\"http://feeds.wordpress.com/1.0/gocomments/genevacricketclub.wordpress.com/2218/\"><img alt=\"\" border=\"0\" src=\"http://feeds.wordpress.com/1.0/comments/genevacricketclub.wordpress.com/2218/\" /></a> <img alt=\"\" border=\"0\" src=\"https://pixel.wp.com/b.gif?host=genevacricketclub.wordpress.com&#038;blog=108392122&#038;post=2218&#038;subd=genevacricketclub&#038;ref=&#038;feed=1\" width=\"1\" height=\"1\" />"},{"date":"2017-02-20T10:25:59.000Z","title":"The Geneva Cricket Club is now an Associate Member of Cricket Switzerland","link":"https://genevacricketclub.wordpress.com/2017/02/20/the-geneva-cricket-club-is-now-an-associate-member-of-cricket-switzerland/","description":"<h4 style=\"text-align:center;\"><img data-attachment-id=\"2216\" data-permalink=\"https://genevacricketclub.wordpress.com/2017/02/20/the-geneva-cricket-club-is-now-an-associate-member-of-cricket-switzerland/cricket-switzerland/\" data-orig-file=\"https://genevacricketclub.files.wordpress.com/2017/02/cricket-switzerland.png?w=748\" data-orig-size=\"175,191\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"cricket-switzerland\" data-image-description=\"\" data-medium-file=\"https://genevacricketclub.files.wordpress.com/2017/02/cricket-switzerland.png?w=748?w=175\" data-large-file=\"https://genevacricketclub.files.wordpress.com/2017/02/cricket-switzerland.png?w=748?w=175\" class=\"alignnone size-full wp-image-2216\" src=\"https://genevacricketclub.files.wordpress.com/2017/02/cricket-switzerland.png?w=748\" alt=\"cricket-switzerland\" srcset=\"https://genevacricketclub.files.wordpress.com/2017/02/cricket-switzerland.png 175w, https://genevacricketclub.files.wordpress.com/2017/02/cricket-switzerland.png?w=137 137w\" sizes=\"(max-width: 175px) 100vw, 175px\"   /></h4>\n<h4>Full Member</h4>\n<p>In the process of its reintegration into the realm of Swiss cricket, the Geneva Cricket Club became an Affiliate Member to Cricket Switzerland (CS) last year. The objective for our Club was obviously to take it to the final stage by becoming a fully fledged member of the Swiss cricket federation.</p>\n<p>Now the objective is accomplished! At the last Annual General Meeting of Cricket Switzerland on 18 February in Bern, Associate Members voted unanimously for elevating the status of our Club.</p>\n<p>This means that Geneva CC has now voting rights and that it is automatically eligible to play any national competition under the auspices of Cricket Switzerland (we previously required an exceptional authorisation from the Members to do so). The Associate membership gives other rights to our Club, such as the power to propose amendments to the constitution or joining other Associates to call for an extraordinary General Meeting, etc.</p>\n<p>The Geneva Cricket Club would like to thank everyone within and outside of Cricket Switzerland for making it possible. We are proud to be part of the great Swiss cricket family!</p>\n<h4>Indoor friendlies against GICC</h4>\n<p>The day that followed the Annual General Meeting, Geneva CC played two T20s against GICC at the indoor sports centre of the Bout-du-Monde in Champel. Not surprisingly, Geneva CC continued their long unbeaten run against GICC and were victorious in the two games:</p>\n<p>First match: <b>Geneva Cricket Club</b>, 132 for 6 in 20 overs (Saqib 39*, Khurram 30 [retired], Leo 2-23), <strong>beat Geneva International Cricket Club</strong>, 106 all out in 20 overs (Leo 35, Khurram 2-5, Ali, 2-7), <strong>by 26 runs</strong></p>\n<p>Second match: <b>Geneva Cricket Club</b>, 125 for 7 in 18.2 overs (Anser 40, Ali 27*, Girish 3-31), <strong>beat Geneva International Cricket Club</strong>, 123 for 7 in 20 overs (Wicky 33, Massoud 1-13), <strong>by 3 wickets</strong></p><br />  <a rel=\"nofollow\" href=\"http://feeds.wordpress.com/1.0/gocomments/genevacricketclub.wordpress.com/2150/\"><img alt=\"\" border=\"0\" src=\"http://feeds.wordpress.com/1.0/comments/genevacricketclub.wordpress.com/2150/\" /></a> <img alt=\"\" border=\"0\" src=\"https://pixel.wp.com/b.gif?host=genevacricketclub.wordpress.com&#038;blog=108392122&#038;post=2150&#038;subd=genevacricketclub&#038;ref=&#038;feed=1\" width=\"1\" height=\"1\" />"}]}